{
  "game_start": "A game starts at the center of the court. One player from each team is chosen to participate in the tip off. The referee throws the ball in the air and the team who gets the ball starts the game as the offensive team. The main goal of the teams is to score a basket",
  "three_points": "Shooting and scoring a field goal from anywhere outside the three-point line arc wins the team three points. These are referred to as three-pointers",
  "two_points": "When a point is scored from inside the area encircled by the three-point arc in the opposition half is worth two points. These are called two-pointers",
  "one_point": "Points can also be accumulated through free-throws, which are worth a point each. Free throws are awarded to a team when the opposition team fouls.During free throw, the fouled player is allowed a fixed number of shots depending on the nature and referee’s interpretation of the foul committed. Free-throws are shot behind the free-throw line",
  "game_length": " A typical game consists of 4 quarters, each 10 minutes long. After two quarters, there is a half-time break, and the teams switch sides after the half-time",
  "shot_clock": "Once the offensive team gains possession of the ball, they have to shoot the ball and attempt a proper basket before 24 seconds that is set in the shot clock. If the team fails to do so, the opponent team gains possession of the ball",
  "violation_1": "An offensive player can keep dribbling the ball using only one hand at a time or passing it to a teammate. If two hands are used while dribbling, it is called a double dribble violation which causes turnover. Also if a player starts dribbling and catches the ball, they must pass or shoot the ball. If they start dribbling again, it is also double dribble",
  "violation_2": "When a player receives the ball while they are moving, they can take two steps before passing, shooting, or start dribbling. If they take more than two steps without dribbling, it is called a traveling violation. Basically, a player is not allowed to run with the ball",
  "violation_3": "If a player holds the ball and stops dribbling, the player should choose a pivot foot which they shouldn’t move with the ball in their hands. They can rotate without moving the pivot foot before passing or shooting. They cannot lift that pivot foot before passing or shooting the ball or it will be a traveling violation",
  "violation_4": "When the offensive team gets the ball, they have to take the ball to the other half in 10 seconds. Once they cross the midline(half court line), they cannot go back to the other half or it will result in a backcourt violation",
  "violation_5": "A defensive player is also not allowed to block or touch the ball when in a downward trajectory towards the basket. This is called goaltending violation",
  "violation_6": "During an attack, an offensive player isn’t allowed to stay in the opposition key for over three seconds without attempting a shot. It is called the three-second rule and results in lane violation",
  "number_of_players":"There are 12 players in a team and 5 players from that team are put on the court. Unlimited substitutions are allowed. Each player have their own positions with different roles:",
  "point_guard":"These are the players with best ball handling. Their primary role is to orchestrate when playing offense and defense and set up scoring opportunities. Point guards defend point guards",
  "shooting_guard":"The best long and short range shooters. They always look for three pointer opportunities or make the defenders go wide to make the area near the basket wide open so other players can make close range shots",
  "small_forward":"These players need to have a variety of skills. They require strength, height, speed, and dribbling abilities. Mid-range shots and short-range shooting abilities are important",
  "power_forward":"These players need to have a variety of skills. They require strength, height, speed, and dribbling abilities. Mid-range shots and short-range shooting abilities are important",
  "center":"The tallest player in the team. They occupy space close to the basket. When they play defense, their task is to rebound and block opponents shots. Their offensive task is to finish close shots or screen defenders to allow their teammates to drive",
  "dimensions":"The basketball court is a rectangular playing area with width of 15m and length of 28m",
  "lines":"Border marking along the length is the Sideline and along the width is Baseline",
  "free_throw":"The outer edge of the key parallel to the endline is called the free-throw line. There’s a 3.6m diameter semi-circle drawn on the outer part of the free-throw line called the free-throw circle",
  "corners":"Four edges outside the three-point line. It is the most common spot to shoot a three pointer and making a shot from there is called a shot from downtown. Players must be careful from crossing the corners while dribbling or it will be out of bounds and it will cause a turnover",
  "wing":"Located near the sidelines. They are good locations for getting the ball down the court to the rims",
  "top_of_the_key":" It is the small arc above the free-throw line. It is a 2-point area so it means if a shot is made from there, 2 points will be awarded",
  "hight_post_low_post":"They are located inside the key(the small black rectangular box below the basket). Players use this area to make easy baskets due to the posts being close to the rim. The Defense should not allow offensive players to get there because it is close to the basket and an easy basket can be scored",
  "elbows":"Located both sides of the free throw line. It is an easy area to score just like the top of the key. It is the same distance to the hoop as the free throw line. Defensive players should be careful and not let offensive players make open shots from this area",
  "midcourt":"Center of the court. This is where tip offs occur in the start of the game"
}